<a href="https://colab.research.google.com/github/rguimaraesbr/rguimaraesbr/blob/main/Aula02_python_parte7e8_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
vet = np.random.randint(1,20,26)
vet

array([ 2, 18, 11, 18,  8,  2, 15, 19, 19, 17,  8, 14,  7,  2,  9, 14, 13,
       11,  2,  8, 19, 12,  5, 13,  2, 10])

In [ ]:
vet.shape

(26,)

In [ ]:
# criar serie a partir do numpy array
df = pd.Series(vet)

In [ ]:
df.head() # 5 primeira linhas da serie

0     2
1    18
2    11
3    18
4     8
dtype: int64

In [ ]:
df.tail(7) # 7 ultimas linhas

19     8
20    19
21    12
22     5
23    13
24     2
25    10
dtype: int64

In [ ]:
# criar dataframe
vet2 = vet.reshape((2,13))
vet2

array([[ 2, 18, 11, 18,  8,  2, 15, 19, 19, 17,  8, 14,  7],
       [ 2,  9, 14, 13, 11,  2,  8, 19, 12,  5, 13,  2, 10]])

In [ ]:
df2 = pd.DataFrame(vet2)

In [ ]:
df2.head()

   0   1   2   3   4  5   6   7   8   9  10  11  12
0  2  18  11  18   8  2  15  19  19  17   8  14   7
1  2   9  14  13  11  2   8  19  12   5  13   2  10

In [ ]:
df2.columns = list(['jan', 'fev', 'mar', 'abril', 'maio', 'jun', 'jul', 'ago', 'set', 'out', 'nov', 'dez', 'jan'])

In [ ]:
df2.head()

   jan  fev  mar  abril  maio  jun  jul  ago  set  out  nov  dez  jan
0    2   18   11     18     8    2   15   19   19   17    8   14    7
1    2    9   14     13    11    2    8   19   12    5   13    2   10

In [ ]:
df2.index = ['allan', 'manoela']

In [ ]:
df2.head()

         jan  fev  mar  abril  maio  jun  jul  ago  set  out  nov  dez  jan
allan      2   18   11     18     8    2   15   19   19   17    8   14    7
manoela    2    9   14     13    11    2    8   19   12    5   13    2   10

In [ ]:
df2.iloc[0,0] # acesssar elemento pelo índice : iloc

2

In [ ]:
df2.loc[['allan', 'manoela'], 'set'] # linhas allan e manoela da col set. loc acessa elemento pelo nome

allan      19
manoela    12
Name: set, dtype: int64

In [ ]:
df2.loc[:, 'set'] #tds as linhas da col set

allan      19
manoela    12
Name: set, dtype: int64

In [ ]:
df2.describe()

       jan        fev       mar  ...        nov        dez       jan
count  2.0   2.000000   2.00000  ...   2.000000   2.000000   2.00000
mean   2.0  13.500000  12.50000  ...  10.500000   8.000000   8.50000
std    0.0   6.363961   2.12132  ...   3.535534   8.485281   2.12132
min    2.0   9.000000  11.00000  ...   8.000000   2.000000   7.00000
25%    2.0  11.250000  11.75000  ...   9.250000   5.000000   7.75000
50%    2.0  13.500000  12.50000  ...  10.500000   8.000000   8.50000
75%    2.0  15.750000  13.25000  ...  11.750000  11.000000   9.25000
max    2.0  18.000000  14.00000  ...  13.000000  14.000000  10.00000

[8 rows x 13 columns]

# exercício

In [ ]:
dados = pd.read_csv('DadosDemograficos.csv')

In [ ]:
dados.head(6)

           Country Name Country Code  ...  Internet users         Income Group
0                 Aruba          ABW  ...            78.9          High income
1           Afghanistan          AFG  ...             5.9           Low income
2                Angola          AGO  ...            19.1  Upper middle income
3               Albania          ALB  ...            57.2  Upper middle income
4  United Arab Emirates          ARE  ...            88.0          High income
5             Argentina          ARG  ...            59.9          High income

[6 rows x 5 columns]

In [ ]:
dados.shape

(195, 5)

Que país tem alta taxa de nascimento (>35), poucas pessoas com acesso à internet (<25) e alta renda? (dica: operador e: &)

In [ ]:
filtro = (dados['Birth rate'] > 35) & (dados['Internet users'] < 25) & (dados['Income Group'] == 'High income')
filtro

0      False
1      False
2      False
3      False
4      False
       ...
190    False
191    False
192    False
193    False
194    False
Length: 195, dtype: bool

In [ ]:
dados[filtro]

         Country Name Country Code  Birth rate  Internet users Income Group
67  Equatorial Guinea          GNQ      35.362            16.4  High income

Que país tem alta taxa de nascimento (>45), poucas pessoas com acesso à internet (<25) e renda média-alta?

In [ ]:
filtro2 = (dados['Birth rate']>45) & (dados['Internet users'] < 25) & (dados['Income Group'] == 'Upper middle income')

In [ ]:
dados[filtro2]

  Country Name Country Code  Birth rate  Internet users         Income Group
2       Angola          AGO      45.985            19.1  Upper middle income

In [ ]:
# Malta
malta = dados['Country Name'] == 'Malta'

In [ ]:
dados[malta]

    Country Name Country Code  Birth rate  Internet users Income Group
116        Malta          MLT         9.5         68.9138  High income